CHANGE_LANGUAGE = 'Γλώσσα διαφημίσεων: Ρωσικά\n\nΟρίστε παραμέτρους /new_parameters'
SELECT_CITY = 'Επιλέξτε πόλη:'
CHOOSE_MIN_PRICE = "Εισάγετε ή επιλέξτε την ελάχιστη τιμή ενοικίου (Ευρώ):"
CHOOSE_MAX_PRICE = "Εισάγετε ή επιλέξτε την μέγιστη τιμή ενοικίου (Ευρώ):"
CONFIRMATION_MSG = 'Τώρα θα λαμβάνετε τις πιο σχετικές διαφημίσεις σύμφωνα με τις παραμέτρους σας:'
CITY = 'Πόλη'
LARNAKA = 'Λάρνακα'
PAPHOS = 'Πάφος'
NICOSIA = 'Λευκωσία'
LIMASSOL = 'Λεμεσός'
CYPRUS = 'Υπόλοιπη Κύπρος'
MY_PARAMETERS = "Οι παράμετροί σας:"
INVALID_INPUT_MSG = "Μη έγκυρη είσοδος"
INVALID_PRICE_INPUT_MSG = 'Μη έγκυρη είσοδος\nΕισάγετε έναν αριθμό από 100 έως 999999, χωρίς κενά και άλλα σύμβολα'
MIN_PRICE = 'Τιμή ενοικίου από '
MAX_PRICE = "έως "
STOP_UPDATE = "\nΔιακοπή ενημερώσεων: /stop"
UPDATE_STOPPED = 'Οι ενημερώσεις διαφημίσεων διακόπηκαν\nΓια επανεκκίνηση, πατήστε /new_parameters'
MSG_ERROR = "Σφάλμα, παρακαλώ προσπαθήστε ξανά"
BOT_START = "Ξεκινήστε το bot"
NEW_PARAM = 'Ορίστε νέες τιμές'
LANGUAGE_COMMAND = 'Αλλάξτε γλώσσα'
LINK_TO_ADD = '\n------------------------------\nΣύνδεσμος προς τη διαφήμιση ---> '
LANGUAGE_SET = "Αλλάξτε γλώσσα /language"
PARAM = '\nΟρίστε νέες παραμέτρους /new_parameters'
GET_DAY_HISTORY = 'GET_DAY_HISTORY'
OPEN_LINK = "Μετάβαση στην αγγελία"
INFO_BOT_COMMAND = "Πληροφορίες για το bot"
STOP_UPDATE_COMMAND = "Διακοπή ενημερώσεων"
MY_PARAM_COMMAND = "Οι παράμετροί μου"
GET_HISTORY_COMMAND = "Λήψη ιστορικού μηνυμάτων"
CHANGE_LANGUAGE_COMMAND = "Αλλαγή γλώσσας"
NEW_PARAM_COMMAND = "Ορισμός νέων τιμών"
TXT_BEFORE_HISTORY_BT = "Μπορείτε να λάβετε το ιστορικό των ανακοινώσεων βάσει των παραμέτρων σας για τις τελευταίες:"
GET_DAY_HISTORY_BT = "24 ώρες"
DEL_HISTORY_BT = "Ευχαριστώ, δεν χρειάζεται"
ERROR_SET_DATA = ("Οι παράμετροι αναζήτησης ενοικιάσεων δεν έχουν οριστεί ακόμη.\n"
                  "Εισάγετε την πόλη και το εύρος τιμών: /new_parameters")
CHOOSE_LANGUAGE = "Παρακαλώ επιλέξτε γλώσσα:"
START_MSG = ("Αυτό το bot θα σας βοηθήσει να απλοποιήσετε τη διαδικασία εύρεσης ενοικιαζόμενης κατοικίας!\n\n"
             "/info - Αναλυτικές πληροφορίες για τις λειτουργίες, τους κανόνες και τους όρους χρήσης του bot."
             "Συνεχίζοντας τη χρήση, συμφωνείτε με τους όρους χρήσης.")
INFO_BOT = (
    "Αυτό το bot σαρώνει πολλές ανοιχτές πηγές για αγγελίες ενοικίασης και σας στέλνει προσφορές βάσει των παραμέτρων σας.\n"
    "Εντολές bot:\n"
    "/new_parameters - Εισαγωγή νέων παραμέτρων και ενεργοποίηση της αποστολής νέων αγγελιών βάσει αυτών των παραμέτρων.\n"
    "/language - Αλλαγή της γλώσσας του bot και των μηνυμάτων που λαμβάνετε.\n"
    "/get_history - Μονομερής λήψη αγγελιών βάσει των παραμέτρων που έχετε εισαγάγει προηγουμένως για μια συγκεκριμένη περίοδο. Αυτή η εντολή δεν εμποδίζει τη λήψη νέων αγγελιών.\n"
    "/my_parameters - Λήψη των τρεχουσών παραμέτρων.\n"
    "/stop - Διακοπή ενημερώσεων και αποστολής αγγελιών.\n"
    "Λαμβάνουμε δεδομένα από ιστότοπους: Bazaraki.com και dom.com.cy, καθώς και από πολλές ομάδες Telegram. Ταξινομούμε τις αγγελίες, επισημαίνουμε τα κύρια χαρακτηριστικά, τα μεταφράζουμε σε διάφορες γλώσσες και ελέγχουμε τα διπλότυπα.\n"
    "Οι αγγελίες με επιλογές: ΝΕΟ ΣΠΙΤΙ (όχι παλαιότερο από 2 έτη) και ΕΠΙΤΡΕΠΟΝΤΑΙ ΤΑ ΚΑΤΟΙΚΙΔΙΑ εμφανίζονται επίσης εάν η αγγελία δεν περιέχει πληροφορίες για το έτος κατασκευής και τα κατοικίδια.\n"
    "Το bot είναι δωρεάν. Οι πληροφορίες που παρέχετε χρησιμοποιούνται μόνο για την επεξεργασία των αγγελιών σύμφωνα με τα αιτήματά σας και δεν κοινοποιούνται σε τρίτους. "
    "Η δωρεάν έκδοση περιλαμβάνει διαφημιστικά υλικά.\n\n"
    "Σε περίπτωση εσφαλμένης λειτουργίας, προτάσεων για βελτίωση του bot ή διαφημιστικής ενσωμάτωσης, παρακαλώ γράψτε στο: @UrbanPurr")
