CHANGED_LANGUAGE = 'Язык объявлений: Русский\n\nЗадать параметры поиска /new_parameters'
SELECT_CITY = 'Выберите город:'
CHOOSE_MIN_PRICE = "Введите или выберите минимальное значение стоимости аренды (Евро):"
CHOOSE_MAX_PRICE = "Введите или выберите максимальное значение стоимости аренды (Евро):"
CONFIRMATION_MSG = 'Теперь Вы будете получать самые актуальные объявления по Вашим параметрам:'
CITY = 'Город'
LARNAKA = 'Ларнака'
PAPHOS = 'Пафос'
NICOSIA = 'Никосия'
LIMASSOL = 'Лимассол'
CYPRUS = 'Весь Кипр'
INVALID_INPUT_MSG = "Некорректный ввод данных"
INVALID_PRICE_INPUT_MSG = 'Некорректный ввод данных\nВведите число от 100 до 999999, без пробелов и других символов'
MIN_PRICE = 'Стоимость аренды от '
MAX_PRICE = "до "
STOP_UPDATE = "\nОстановить рассылку: /stop"
UPDATE_STOPPED = 'Рассылка объявлений остановлена\nДля повторного запуска нажмите /new_parameters'
MSG_ERROR = "Ошибка, попробуйте снова"
BOT_START = "Запустить бота"
LANGUAGE_COMMAND = 'Поменять язык'
LINK_TO_ADD = '\n------------------------------\nСсылка на объявление ---> '
LANGUAGE_SET = "Поменять язык /language"
INFO_BOT_COMMAND = "Информация о работе бота"
PARAM = '\nЗадать новые параметры /new_parameters'

OPEN_LINK = 'Перейти к объявлению'
INFO_BOT_COMMAND = "Информация о боте"
STOP_UPDATE_COMMAND = 'Остановить рассылку'
MY_PARAM_COMMAND = 'Мои параметры'
GET_HISTORY_COMMAND = 'Получить историю сообщений'
CHANGE_LANGUAGE_COMMAND = 'Изменить язык'
NEW_PARAM_COMMAND = 'Установить новые значения'
TXT_BEFORE_HISTORY_BT = 'Вы можете получить историю объявлений по Вашим параметрам за последние:'
GET_DAY_HISTORY_BT = '24 часа'
DEL_HISTORY_BT = 'Cпасибо, не нужно'
ERROR_SET_DATA = ('Параметры для поиска аренды еще не установлены\n'
                  'Введите  город и диапозон цен: /new_parameters')
CHOOSE_LANGUAGE = 'Пожалуйста, выберите язык: '
START_MSG = ('Данный бот поможет Вам заметно упростить процесс поиска аренды жилья!\n\n'
             '/info - Подробно о функциях, а так же о правилах и условиях пользованием ботом.'
             'Продолжая использование, Вы соглашаетесь с уловиями пользования.')
INFO_BOT = ("Данный бот сканирует множество открытых источников с объявлениями аренды и рассылает Вам предложения по "
            "Вашим параметрам. \n"
            "Комманды бота:\n"
            "/new_parameters - Внесение новых параметров и ативация рассылки новых объявлений по данным параметрам,\n"
            "/language - Изменеие языка бота и получаемых сообщений,\n"
            "/get_history - Единоразовое получение объявлений по Вашим предварительно внесенным параметрам за "
            "определенный промежуток времени. Данная команда не препятствует получению новых объявлений,\n"
            "/my_parameters - Получение параметров которые установленны на данный момент,\n"
            "/stop - Остановка обновлений и рассылки объявлений.\n"
            "Мы получаем данные с сайтов: Bazaraki.com и dom.com.cy, а так же со множества групп в телеграме,"
            "Сортируем, вычленяем основные параметры, переводим на различные языки и так же производим контроль "
            "дубликатов.\n"
            "Вывод объявлений с опциями: НОВЫЙ ДОМ(не старше 2х лет) и РАЗРЕШЕННО С ЖИВОТНЫМИ производится так же в "
            "случае отсутствия в объявлении: года постройки и информации о животных.\n"
            "Бот является бесплатным. Информация предоставленная Вами используется только для "
            "обработки объявлений под Ваши запросы и не передается третим лицам."
            "В бесплатной версии предусматривается рассылка рекламных материалов.\n\n"
            "В случае: не корректной работы, предложений по улучшению бота или рекламной интеграции прошу написать:"
            "@UrbanPurr")
